RESULTS_VM/redis_docker_20251115-2357.txt
=== 2025-11-15 23:57:56 — workload=redis env=docker run=1/7 ===
$ memtier_benchmark -s 192.168.1.60 -p 6379 --ratio=1:10 -t 4 -c 50 -d 64 -n 500000
4         Threads
50        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1377.23          ---          ---       276.80931        13.50300        26.62300        65.53500       149.14 
Gets        13772.12        32.22     13739.90       274.79829        13.50300        26.62300        65.53500       538.55 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      15149.35        32.22     13739.90       274.98112        13.50300        26.62300        65.53500       687.69 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.495        0.000
SET      11.711        5.000
SET      12.415       10.000
SET      12.735       15.000
SET      12.991       20.000
SET      13.119       25.000
SET      13.247       30.000
SET      13.311       35.000
SET      13.375       40.000
SET      13.439       45.000
SET      13.503       50.000
SET      13.567       52.500
SET      13.567       55.000
SET      13.631       57.500
SET      13.695       60.000
SET      13.695       62.500
SET      13.759       65.000
SET      13.823       67.500
SET      13.887       70.000
SET      13.951       72.500
SET      14.015       75.000
SET      14.079       76.250
SET      14.207       77.500
SET      14.399       78.750
SET      14.847       80.000
SET      15.487       81.250
SET      15.935       82.500
SET      16.191       83.750
SET      16.511       85.000
SET      16.767       86.250
SET      17.023       87.500
SET      17.023       88.125
SET      17.151       88.750
SET      17.279       89.375
SET      17.279       90.000
SET      17.407       90.625
SET      17.407       91.250
SET      17.535       91.875
SET      17.535       92.500
SET      17.663       93.125
SET      17.663       93.750
SET      17.663       94.062
SET      17.791       94.375
SET      17.791       94.688
SET      17.791       95.000
SET      17.919       95.312
SET      17.919       95.625
SET      18.047       95.938
SET      18.303       96.250
SET      18.687       96.562
SET      19.583       96.875
SET      19.967       97.031
SET      20.223       97.188
SET      20.607       97.344
SET      20.991       97.500
SET      21.247       97.656
SET      21.631       97.812
SET      22.015       97.969
SET      22.399       98.125
SET      23.167       98.281
SET      24.319       98.438
SET      24.831       98.516
SET      25.343       98.594
SET      25.727       98.672
SET      25.983       98.750
SET      26.111       98.828
SET      26.367       98.906
SET      26.623       98.984
SET      26.751       99.062
SET      27.007       99.141
SET      27.647       99.219
SET      28.287       99.258
SET      29.183       99.297
SET      30.079       99.336
SET      31.103       99.375
SET      31.871       99.414
SET      33.023       99.453
SET      34.047       99.492
SET      34.559       99.531
SET      35.583       99.570
SET      37.119       99.609
SET      38.143       99.629
SET      39.167       99.648
SET      40.447       99.668
SET      41.471       99.688
SET      42.751       99.707
SET      43.775       99.727
SET      45.311       99.746
SET      46.847       99.766
SET      48.383       99.785
SET      50.431       99.805
SET      51.455       99.814
SET      52.479       99.824
SET      53.759       99.834
SET      55.039       99.844
SET      56.319       99.854
SET      57.855       99.863
SET      59.647       99.873
SET      61.439       99.883
SET      63.487       99.893
SET      66.559       99.902
SET      67.583       99.907
SET      69.119       99.912
SET      70.655       99.917
SET      72.703       99.922
SET      75.263       99.927
SET      78.335       99.932
SET      80.895       99.937
SET      83.967       99.941
SET      87.551       99.946
SET      92.671       99.951
SET     101.375       99.954
SET     149.503       99.956
SET    603979.750       99.958
SET    603979.750      100.000
---
GET       0.455        0.000
GET      11.711        5.000
GET      12.415       10.000
GET      12.735       15.000
GET      12.991       20.000
GET      13.119       25.000
GET      13.247       30.000
GET      13.311       35.000
GET      13.375       40.000
GET      13.439       45.000
GET      13.503       50.000
GET      13.567       52.500
GET      13.567       55.000
GET      13.631       57.500
GET      13.695       60.000
GET      13.695       62.500
GET      13.759       65.000
GET      13.823       67.500
GET      13.823       70.000
GET      13.951       72.500
GET      14.015       75.000
GET      14.079       76.250
GET      14.207       77.500
GET      14.399       78.750
GET      14.847       80.000
GET      15.487       81.250
GET      15.935       82.500
GET      16.191       83.750
GET      16.383       85.000
GET      16.767       86.250
GET      17.023       87.500
GET      17.023       88.125
GET      17.151       88.750
GET      17.279       89.375
GET      17.279       90.000
GET      17.407       90.625
GET      17.407       91.250
GET      17.535       91.875
GET      17.535       92.500
GET      17.663       93.125
GET      17.663       93.750
GET      17.663       94.062
GET      17.791       94.375
GET      17.791       94.688
GET      17.791       95.000
GET      17.919       95.312
GET      17.919       95.625
GET      18.047       95.938
GET      18.303       96.250
GET      18.815       96.562
GET      19.583       96.875
GET      19.967       97.031
GET      20.223       97.188
GET      20.607       97.344
GET      20.991       97.500
GET      21.247       97.656
GET      21.631       97.812
GET      22.015       97.969
GET      22.527       98.125
GET      23.167       98.281
GET      24.319       98.438
GET      24.831       98.516
GET      25.343       98.594
GET      25.727       98.672
GET      25.983       98.750
GET      26.111       98.828
GET      26.367       98.906
GET      26.623       98.984
GET      26.751       99.062
GET      27.135       99.141
GET      27.647       99.219
GET      28.287       99.258
GET      29.183       99.297
GET      30.079       99.336
GET      31.103       99.375
GET      31.871       99.414
GET      33.023       99.453
GET      34.047       99.492
GET      34.559       99.531
GET      35.583       99.570
GET      37.375       99.609
GET      38.143       99.629
GET      39.423       99.648
GET      40.447       99.668
GET      41.471       99.688
GET      42.751       99.707
GET      44.031       99.727
GET      45.311       99.746
GET      46.847       99.766
GET      48.639       99.785
GET      50.687       99.805
GET      51.711       99.814
GET      52.735       99.824
GET      54.015       99.834
GET      55.039       99.844
GET      56.575       99.854
GET      58.111       99.863
GET      59.903       99.873
GET      61.695       99.883
GET      63.743       99.893
GET      66.559       99.902
GET      67.583       99.907
GET      69.119       99.912
GET      70.655       99.917
GET      72.703       99.922
GET      75.263       99.927
GET      78.335       99.932
GET      80.895       99.937
GET      83.967       99.941
GET      87.551       99.946
GET      92.159       99.951
GET      98.815       99.954
GET     139.263       99.956
GET    603979.750       99.958
GET    603979.750      100.000
---
WAIT      0.000      100.000
=== end ===